; domain
(define (domain blockWorld)
  (:requirements :strips :typing)
  (:types block)
  (:predicates
    (on ?x - block ?y - block)
    (ontable ?x - block)
    (clear ?x - block)
    (handempty)
    (holding ?x - block))
  (:action pick-up
    ;;; action qui ramasse un bloc pose sur la table
    :parameters (?x - block)
    :precondition (and (clear ?x) (ontable ?x) (handempty))
    :effect (and (not (ontable ?x))
            (not (clear ?x))
            (not (handempty))
            (holding ?x)))
  (:action unstack
    ;;; action qui ramasse un bloc pose sur un autre
    :parameters (?x - block ?y - block)
    :precondition (and (clear ?x) (on ?x ?y) (handempty))
    :effect (and (not (on ?x ?y))
            (not (clear ?x))
            (not (handempty))
            (holding ?x)
            (clear ?y)))
  (:action put-down
    ;;; action qui pose un bloc sur la table
    :parameters (?x - block)
    :precondition (holding ?x)
    :effect (and (not (holding ?x))
            (clear ?x)
            (handempty)
            (ontable ?x)))
  (:action stack
    ;;; action qui pose un bloc sur un autre
    :parameters (?x - block ?y - block)
    :precondition (and (holding ?x) (clear ?y))
    :effect (and (not (holding ?x))
            (not (clear ?y))
            (clear ?x)
            (handempty)
            (on ?x ?y))))

; problem
(define (problem blockProblem)
	(:domain blockWorld)
	(:objects A B C D - block)
	(:init (clear B) (ontable A) (on B A) (clear C) (ontable D) (on C D) (handempty))
	(:goal (and (on A B) (on B C) (on C D) (ontable D) (clear A) (handempty)))
)

; plan
1. (unstack b a)
   deleted: (on b a) (clear b) (handempty)
   added: (holding b) (clear a)
   goals met: 3 of 6
2. (stack b c)
   deleted: (holding b) (clear c)
   added: (clear b) (handempty) (on b c)
   goals met: 5 of 6
3. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 3 of 6
4. (stack a b)
   deleted: (holding a) (clear b)
   added: (clear a) (handempty) (on a b)
   goals met: 6 of 6
